{"config": [{"config": {"embeddings_regularizer": null, "activity_regularizer": null, "trainable": true, "mask_zero": true, "embeddings_constraint": null, "batch_input_shape": [null, 922], "dtype": "int32", "name": "embedding_1", "output_dim": 100, "embeddings_initializer": {"config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "class_name": "RandomUniform"}, "input_length": 922, "input_dim": 30551}, "class_name": "Embedding"}, {"config": {"bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "recurrent_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "recurrent_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "activation": "tanh", "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "units": 128, "implementation": 0, "go_backwards": false, "use_bias": true, "recurrent_dropout": 0.0, "dropout": 0.0, "name": "lstm_1", "kernel_constraint": null, "recurrent_activation": "hard_sigmoid", "stateful": false, "return_sequences": true, "unit_forget_bias": true, "unroll": false, "bias_constraint": null}, "class_name": "LSTM"}, {"config": {"name": "time_distributed_1", "trainable": true, "layer": {"config": {"units": 40, "use_bias": true, "trainable": true, "kernel_regularizer": null, "name": "dense_1", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "activation": "softmax", "bias_regularizer": null, "bias_constraint": null}, "class_name": "Dense"}}, "class_name": "TimeDistributed"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.3"}