{"keras_version": "2.0.3", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"dtype": "int32", "name": "embedding_1", "batch_input_shape": [null, 922], "output_dim": 32, "activity_regularizer": null, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "embeddings_constraint": null, "input_length": 922, "input_dim": 30552, "mask_zero": true, "trainable": true}}, {"class_name": "LSTM", "config": {"kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "dropout": 0.0, "recurrent_dropout": 0.0, "trainable": true, "bias_constraint": null, "implementation": 0, "name": "lstm_1", "recurrent_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "unit_forget_bias": true, "bias_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_activation": "hard_sigmoid", "stateful": false, "activation": "tanh", "unroll": false, "recurrent_regularizer": null, "use_bias": true, "units": 128, "go_backwards": false, "return_sequences": true}}, {"class_name": "TimeDistributed", "config": {"trainable": true, "name": "time_distributed_1", "layer": {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "activation": "softmax", "use_bias": true, "bias_constraint": null, "units": 40, "name": "dense_1"}}}}]}