{"config": [{"config": {"trainable": true, "input_length": 922, "output_dim": 100, "dtype": "int32", "embeddings_constraint": null, "activity_regularizer": null, "mask_zero": false, "name": "embedding_1", "embeddings_regularizer": null, "input_dim": 30551, "batch_input_shape": [null, 922], "embeddings_initializer": {"config": {"seed": null, "minval": -0.05, "maxval": 0.05}, "class_name": "RandomUniform"}}, "class_name": "Embedding"}, {"config": {"trainable": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "strides": [1], "bias_constraint": null, "activity_regularizer": null, "name": "conv1d_1", "filters": 64, "kernel_regularizer": null, "kernel_constraint": null, "activation": "relu", "use_bias": true, "kernel_size": [3], "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1]}, "class_name": "Conv1D"}, {"config": {"padding": "valid", "trainable": true, "strides": [2], "name": "max_pooling1d_1", "pool_size": [2]}, "class_name": "MaxPooling1D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activity_regularizer": null, "name": "dense_1", "kernel_regularizer": null, "kernel_constraint": null, "activation": "relu", "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "units": 254}, "class_name": "Dense"}, {"config": {"trainable": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activity_regularizer": null, "name": "dense_2", "kernel_regularizer": null, "kernel_constraint": null, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "units": 38}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.0.3"}